# -*- coding: utf-8 -*-

# (if/elif/else)

# Заданы размеры A, B - размеры конверта и x, y листа бумаги (все размеры
# могут быть в диапазоне от 1 до 1000)
#
# Определить, поместится ли бумага в конверте (стороны листа параллельны сторонам конверта)
#
# Результат проверки вывести на консоль (ДА/НЕТ)
# Использовать только операторы if/elif/else, можно вложенные

A, B = 10, 7
x, y = 8, 9
# проверить для
# x, y = 9, 8
# x, y = 6, 8
# x, y = 8, 6
# x, y = 3, 4
# x, y = 11, 9
# x, y = 9, 11
# просто раскоментировать нужную строку и проверить свой код

# TODO здесь ваш код

# (усложненное задание, решать по желанию)
# Заданы размеры А, В прямоугольного отверстия и размеры х, у, z кирпича (все размеры
# могут быть в диапазоне от 1 до 1000)
#
# Определить, пройдет ли кирпич через отверстие (грани кирпича параллельны сторонам отверстия)

# A, B = 8, 9
# x, y, z = 11, 10, 2
# x, y, z = 11, 2, 10
# x, y, z = 10, 11, 2
# x, y, z = 10, 2, 11
# x, y, z = 2, 10, 11
# x, y, z = 2, 11, 10
# x, y, z = 3, 5, 6
# x, y, z = 3, 6, 5
# x, y, z = 6, 3, 5
# x, y, z = 6, 5, 3
# x, y, z = 5, 6, 3
# x, y, z = 5, 3, 6
# x, y, z = 11, 3, 6
# x, y, z = 11, 6, 3
# x, y, z = 6, 11, 3
# x, y, z = 6, 3, 11
# x, y, z = 3, 6, 11
# x, y, z = 3, 11, 6
# просто раскоментировать нужную строку и проверить свой код

# TODO здесь ваш код
