def add_bun(bun_half=0):
    if bun_half is 1:
        print("Булочку разрезаем вдоль на две половинки")
    else:
        print("Получившуюся конструкцию накрываем шляпкой от булочки")


def add_cutlet():
    print("Далее кладем сочную котлетку")


def add_pickle():
    print("Кладем несколько кусочков маринованного огурчика")


def add_tomato():
    print("Добавляем пару кружочков свежего помидорчика")


def add_mayo():
    print("Смазываем майонезом")


def add_cheese():
    print("Сверху помещаем пластик сыра")


def add_onion():
    print("Кладем колечки красного лука")


def add_bacon():
    print("А теперь добавим два кусочка обжаренного бекона")


def add_jack_sauce():
    print("Щедро поливаем начинку соусом \"Джек Дэниэлс\"")


def eat(burger_name="двойным чизбургером"):
    print("Наслаждаемся безукоризненным", burger_name)
